Autodesk.Revit.DB.RevisionNumberingSequence.IsEqualInternal(Autodesk.Revit.DB.RevisionNumberingSequence)
Compares this revision numbering sequence to another.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.HasValidAlphanumericRevisionSettings
Checks whether the revision numbering sequence owns a valid alphanumeric revision settings.
Returns:
True if the revision numbering sequence owns a valid alphanumeric revision settings.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.HasValidNumericRevisionSettings
Checks whether the revision numbering sequence owns a valid numeric revision settings.
Returns:
True if the revision numbering sequence owns a valid numeric revision settings.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.HasValidRevisionSettingsForNumberType
Checks whether the revision numbering sequence owns a valid revision settings for number type.
Returns:
True if the revision numbering sequence owns a valid revision settings for number type.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.GetAllRevisionNumberingSequences(Autodesk.Revit.DB.Document)
Gets all of the revision numbering sequences from the document.
document:
The document that contains the sequences.
Returns:
The revision numbering sequences from the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.SetAlphanumericRevisionSettings(Autodesk.Revit.DB.AlphanumericRevisionSettings)
Replaces the current alphanumeric revision numbering settings with the provided settings.
settings:
The AlphanumericRevisionSettings to be applied to alphanumeric revision numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
settings is not a valid AlphanumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.GetAlphanumericRevisionSettings
Returns a copy of the AlphanumericRevisionSettings owned by this revision numbering sequence.
Returns:
The copy of the AlphaumericRevisionSettings owned by this revision numbering sequence.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevisionNumberingSequence doesn't own a valid alphanumeric revision settings.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.SetNumericRevisionSettings(Autodesk.Revit.DB.NumericRevisionSettings)
Replaces the current numeric revision numbering settings with the provided settings.
settings:
The NumericRevisionSettings to be applied to numeric revision numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
settings is not a valid NumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.GetNumericRevisionSettings
Returns a copy of the NumericRevisionSettings owned by this revision numbering sequence.
Returns:
The copy of the NumericRevisionSettings owned by this revision numbering sequence.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevisionNumberingSequence doesn't own a valid numeric revision settings.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.CreateAlphanumericSequence(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.AlphanumericRevisionSettings)
Creates a new alphanumeric revision numbering sequence in the document.
Remarks:
The new revision numbering sequence will not be assigned to any revision.
Use `Revision.SetRevisionNumberingSequenceId` to apply the sequence to a revision.
document:
The document of the new revision numbering sequence.
name:
The name for the revision numbering sequence.
settings:
The alphanumeric settings for the revision numbering sequence.
Returns:
The newly created revision numbering sequence.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
settings is not a valid AlphanumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.CreateNumericSequence(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.NumericRevisionSettings)
Creates a new numeric revision numbering sequence in the document.
Remarks:
The new revision numbering sequence will not be assigned to any revision.
Use `Revision.SetRevisionNumberingSequenceId` to apply the sequence to a revision.
document:
The document of the new revision numbering sequence.
name:
The name for the revision numbering sequence.
settings:
The numeric settings for the revision numbering sequence.
Returns:
The newly created revision numbering sequence.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
settings is not a valid NumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.NumberType
Indicates the revision number type of the revision numbering sequence.
Remarks:
This property can be used to figure out if a revision numbering sequence is numeric or alphanumeric.
The returned RevisionNumberType is either RevisionNumberType::Numeric or RevisionNumberType::Alphanumeric.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevisionNumberingSequence doesn't own a valid revision settings for number type.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.SequenceName
The name of this revision numbering sequence.
Remarks:
This name appears in the Sheet Issues/Revisions dialog as a numbering choice for each revision.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: sequenceName is an empty string or contains only whitespace.
-or-
When setting this property: sequenceName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence
Defines the sequences by which numbers are assigned to Revisions.
Remarks:
Revision numbering is numeric or alphanumeric. Revision numbering is assigned to Revisions to control
the numbering scheme of that Revision.
Since:
2022